HajjSalad/STM32-Traffic-Control/Src/main.c
/*
 * main.c - Entry point and main flow of the program
*/

#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>

#include "uart.h"
#include "exti.h"
#include "main.h"
#include "lights.h"
#include "systick.h"
#include "stm32f446xx.h"

const uint32_t BUTTON[BUTTONS] = {BUTTON1, BUTTON2, BUTTON3, BUTTON4};

TrafficLight Light[4];			// Instantiate 4 traffic light

// Map Light to Register addresses
void map_lights(void) {
	Light[0] = (TrafficLight){GREEN, 0, 10, 4};		// High traffic - start with GREEN
	Light[1] = (TrafficLight){RED, 0, 5, 3};		// Low traffic - start with RED
	Light[2] = (TrafficLight){GREEN, 0, 2, 1};
	Light[3] = (TrafficLight){RED, 0, 14, 13};
}

uint32_t waitingQueue[MAX_WAITING_PAIR];
int front = -1, rear = -1;

bool isQueueEmpty() {
	return (front == -1);
}

bool isQueueFull() {
	return ((rear + 1) % MAX_WAITING_PAIR == front);
}

void enqueue(uint32_t lightPair) {
	if (!isQueueFull()) {
		if (front == -1) front = 0;		// Initialize front
		rear = (rear + 1) % MAX_WAITING_PAIR;
		waitingQueue[rear] = lightPair;
	}
}

uint32_t dequeue() {
    if (isQueueEmpty()) return -1;  // No waiting pairs
    uint32_t lightPair = waitingQueue[front];
    if (front == rear) {  // Queue empty after removing
        front = rear = -1;
    } else {
        front = (front + 1) % MAX_WAITING_PAIR;
    }
    return lightPair;
}

bool timerActive = false;           // Flag to track if commonTimer is running
uint32_t timerStartTime = 0;        // Start time of active timer
uint32_t allocatedTime = 0;         // Time allocated to the green light
uint32_t activeLightPair = -1;		// Track which light pair has the timer

bool waitingForProcess = false;
bool waitForTimer = false;			// Indicate another light Pair is waiting for the timer
uint32_t waitingLightPair = -1;  	// Store the next subsequent pairs waiting to run
uint32_t firstPressTime = 0;
uint32_t firstPair = -1;

//void changeLight(int lightPair[]) {
//	// Light1-Light3 request to go, check if timer for opposite side done
//	if (lightPair[1] == 2) {
//		while (systickGetMillis() < Light[1].timerEnd ||
//			   systickGetMillis() < Light[3].timerEnd) {
//			// Busy-wait until both timers expire
//			printf("Waiting for timer on Light2-Light4 to end.\n\r");
//		}
//		if (stopState(1, 3)) {
//			startCountdown(0, 2);
//			goState(0, 2);
//		}
//	} else if(lightPair[1] == 3) {
//		while (systickGetMillis() < Light[0].timerEnd ||
//			   systickGetMillis() < Light[2].timerEnd) {
//			// Busy-wait until both timers expire
//			printf("Waiting for timer on Light1-Light3 to end.\n\r");
//		}
//		if (stopState(0, 2)) {
//			startCountdown(1, 3);
//			goState(1, 3);
//		}
//	}
//}

// Update the appropriate LED based on state
void updateLight(int lightNum) {
	switch (Light[lightNum].state) {
		case RED:
			GPIOB->BSRR = (1U << (Light[lightNum].redPin + 16));  	// RED LED ON
			GPIOB->BSRR = (1U << Light[lightNum].greenPin);			// GREEN LED OFF
			break;
		case YELLOW:
			// Turn ON both RED and GREEN to get YELLOW
			GPIOB->BSRR = ((1U << (Light[lightNum].redPin + 16)) | (1U <<(Light[lightNum].greenPin + 16)));
			break;
		case GREEN:
			GPIOB->BSRR = (1U << (Light[lightNum].greenPin + 16));  // GREEN LED ON
			GPIOB->BSRR = (1U << Light[lightNum].redPin);			// RED LED OFF
			break;
		case OFF:
			// Turn off both RED and GREEN to turn Light off
			GPIOB->BSRR = ((1U << Light[lightNum].redPin) | (1U << Light[lightNum].greenPin));
			break;
	}
}

void go(int lightNum1, int lightNum2) {
	if (Light[lightNum1].state == RED || Light[lightNum2].state == RED) {
		// Transition directly from RED to GREEN
		Light[lightNum1].state = GREEN;
		Light[lightNum2].state = GREEN;
		printf("Light %d turned GREEN\n\r", lightNum1 + 1);
		printf("Light %d turned GREEN\n\r", lightNum2 + 1);
	} else {
		printf("Light %d is already GREEN\n\r", lightNum1 + 1);
		printf("Light %d is already GREEN\n\r", lightNum2 + 1);
	}
	updateLight(lightNum1);
	updateLight(lightNum2);
}

uint32_t stop(int lightNum1, int lightNum2) {
	if (Light[lightNum1].state == GREEN || Light[lightNum2].state == GREEN) {
		// Transition directly from GREEN to RED
		Light[lightNum1].state = RED;
		Light[lightNum2].state = RED;
		printf("Light %d turned RED\n\r", lightNum1 + 1);
		printf("Light %d turned RED\n\r", lightNum2 + 1);
	} else {
		printf("Light %d is already RED\n\r", lightNum1 + 1);
		printf("Light %d is already RED\n\r", lightNum2 + 1);
	}
	updateLight(lightNum1);
	updateLight(lightNum2);

	return 1;
}

void changeLight(uint32_t light1, uint32_t light2) {

	activeLightPair = light1;		// Register the active light pair

	// Check which light in the pair has higher carCount
	int carNums = (Light[light1].carCount > Light[light2].carCount) ?
			Light[light1].carCount : Light[light2].carCount;
	// Allocate time based on car count - 1 car = 2secs, 2 cars = 3secs, More than 3 = 5secs
	allocatedTime = (carNums >= 3) ? 5 : (carNums == 2) ? 3 : 2;
	printf("Light%ld-%ld allocated timer: %ld\n\r", light1+1, light1+3, allocatedTime*1000);

	// Start timer
	timerStartTime = systickGetMillis();
	timerActive = true;

    if (light1 == 0 || light1 == 2) {
        if (stop(1, 3)) {
			go(0, 2);
		} else {
			printf("Could not stop light2-4\n\r");
		}
    } else if (light1 == 1 || light1 == 3) {
        if (stop(0, 2)) {
			go(1, 3);
		} else {
			printf("Could not stop light1-3\n\r");
		}
    }

    Light[light1].carCount = 0;			// Reset car count
    Light[light2].carCount = 0;			// Reset car count
}

// Common timer - manages active light duration
void commonTimer() {
	uint32_t currentTime = systickGetMillis();

	if (timerActive && (currentTime - timerStartTime >= allocatedTime * 1000)) {
		printf("Allocated time finished - Timer released\n\r");
		timerActive = false;
		activeLightPair = -1;

		// Check for waiting pairs
		uint32_t nextPair = dequeue();
		if (nextPair != -1) {
			printf("Processing waiting light pair %ld-%ld\n\r", nextPair+1, nextPair+2);
			changeLight(nextPair, nextPair+2);
		}
	}
}

void SysTick_Runner(void) {
	uint32_t currentTime = systickGetMillis();

	if (waitingForProcess && (currentTime - firstPressTime >= 3000)) {
		uint32_t light1, light2;
		bool pair1_3 = false, pair2_4 = false;

		// Determine which pairs need to be queued
		if (firstPair == 0 || firstPair == 2) {
			light1 = 0;
			light2 = 2;
			pair2_4 = true;
		}
		if (firstPair == 1 || firstPair == 3) {
			light1 = 1;
			light2 = 3;
			pair1_3 = true;
		}

		// Queue requests
		if (pair1_3) {
			enqueue(0);
			printf("Light 1-3 queued.\n\r");
		}
		if (pair2_4) {
			enqueue(1);
			printf("Light 2-4 queued.\n\r");
		}

		// Process the first request in the queue
		uint32_t nextPair = dequeue();
		if (nextPair != -1) {
			printf("Processing Light %ld-%ld \n\r", nextPair+1, nextPair+3);
			changeLight(nextPair, nextPair+2);
		}

		waitingForProcess = false;		// Reset after processing
		firstPair = -1;					// Reset
	}
}

//void SysTick_Runner(void) {
//	uint32_t currentTime = systickGetMillis();
//
//	if (waitingForProcess && (currentTime - firstPressTime >= 3000)) {
//		uint32_t light1, light2;
//
//		// Determine which pair should go first
//		if (firstPair == 0 || firstPair == 2) {
//			light1 = 0;
//			light2 = 2;
//		} else {
//			light1 = 1;
//			light2 = 3;
//		}
//
//		// Check if the timer is active
//		if (timerActive) {
//			enqueue(light1);
//			printf("Timer busy. Light %ld-%ld queued.\n\r", light1+1, light2+1);
//		} else {
//			printf("Processing Light %ld-%ld \n\r", light1+1, light2+1);
//			changeLight(light1, light2);
//		}
//
//		waitingForProcess = false;		// Reset after processing
//		firstPair = -1;					// Reset
//	}
//}

// Button input for car detection - Handle button press
void EXTI15_10_IRQHandler(void) {
	static uint32_t lastPressTime[BUTTONS] = {0};
	uint32_t currentTime = systickGetMillis();

