HajjSalad/STM32-Traffic-Control/Src/main.c
	for (int i=0; i<BUTTONS; i++) {
		if ((EXTI->PR & BUTTON[i]) != 0) {
			// Check if after 100ms - Prevent debounce that result in consecutive presses
			if (currentTime - lastPressTime[i] >= DEBOUNCE_TIME) {
				lastPressTime[i] = currentTime;  	// Update last press time
				Light[i].carCount++;				// Increment car count
				printf("Light %d car detected: %d\n\r", i+1, Light[i].carCount);

				if (!waitingForProcess) {			// If this is the first press this round
					firstPressTime = currentTime;	// Record the time of the first press
					waitingForProcess = true;		// Place us in the waiting period
					firstPair = i;					// Pick the first button press
				}
			}
			EXTI->PR |= BUTTON[i];		// Clear interrupt (PR) flag
		}
	}
}

//
//void SysTick_wait3secs(void) {
//	uint32_t currentTime = systickGetMillis();
//
//	if (waitingForProcess && (currentTime - firstPressTime >= 3000)) {
//
//		// Process the pair that was pressed first
//		if (firstPair == 0 || firstPair == 2) {
//			printf("Processing Light 1-3 first\n\r");
//			changeLight(0, 2);  // Process Light 1 & 3
//			changeLight(1, 3);  // Process Light 2 & 4
//		} else {
//			printf("Processing Light 2-4 first\n\r");
//			changeLight(1, 3);  // Process Light 2 & 4
//			changeLight(0, 2);  // Process Light 1 & 3
//		}
//
//		waitingForProcess = false;	// Reset after processing
//	}
//}

int main() {
	lights_init();					// Initialize light GPIO registers
	exti_init();					// Initialize the input interrupts
	uart2_init();					// Initialize UART
	systick_init();					// Initialize SysTick
	map_lights();					// Map the lights

	printf("\n\r ** Program Start **\n\r");

	// Set the initial states of the lights
//	printf("Set initial light states\n\r");
//	for (int i=0; i<4; i++) {
//		updateLight(i);
//		printf("Light %d is %s\n\r", i + 1, (Light[i].state == GREEN) ? "GREEN" : "RED");
//	}

	while(1) {}
}
//
//uint32_t lightPair = -1;			// Track which light pair was pressed
//uint32_t firstPressTime = 0;		// Track when the first button was pressed
//bool waitingForProcess = false;		// Indicate we're in waiting period
//
//// Button input for car detection - Handle button press
//void EXTI15_10_IRQHandler(void) {
//	static uint32_t lastPressTime[BUTTON_COUNT] = {0};
//	uint32_t currentTime = systickGetMillis();
//
//	for (int i=0; i<BUTTON_COUNT; i++) {
//		if ((EXTI->PR & BUTTONS[i]) != 0) {
//			// Check if after 100ms - Prevent debounce that result in consecutive presses
//			if (currentTime - lastPressTime[i] >= DEBOUNCE_TIME) {
//				lastPressTime[i] = currentTime;  	// Update last press time
//				Light[i].carCount++;				// Increment car count
//				printf("Light %d car detected: %d\n\r", i+1, Light[i].carCount);
//
//				if (!waitingForProcess) {			// If this is the first press this round
//					firstPressTime = currentTime;	// Record the time
//					waitingForProcess = true;		// Place us in the waiting period
//				}
//				lightPair = i;						// Store the light index
//			}
//			EXTI->PR |= BUTTONS[i];		// Clear interrupt (PR) flag
//		}
//	}
//}
//
//// Timer interupt check if 3secs have passed - 3secs to allow for multiple presses
//void wait3secs(void) {
//	uint32_t currentTime = systickGetMillis();
//
//	if (waitingForProcess && (currentTime - firstPressTime >= 3000)) {
//		changeLight(lightPair);
//		lightPair = -1;				// Reset after processing
//		waitingForProcess = false;	// Reset after processing
//	}
//}

//// Button input interrupt Handler
//void EXTI15_10_IRQHandler(void) {
//	static uint32_t lastPressTime[4] = {0};
//	uint32_t currentTime = systickGetMillis();
//
//	if ((EXTI->PR & BUTTON1) != 0) {
//		// Check if after 100ms - Prevent debounce that result in consecutive presses
//		if (currentTime - lastPressTime[0] >= DEBOUNCE_TIME) {
//			lastPressTime[0] = currentTime;  	// Update last press time
//			Light[0].carCount++;				// Increment car count
//			printf("Light 1 car detected: %d\n\r", Light[0].carCount);
//		}
//		EXTI->PR |= BUTTON1;		// Clear interrupt (PR) flag
//	} else if ((EXTI->PR & BUTTON2) != 0) {
//		if (currentTime - lastPressTime[1] >= DEBOUNCE_TIME) {
//			lastPressTime[1] = currentTime;
//			Light[1].carCount++;
//			printf("Light 2 car detected: %d\n\r", Light[1].carCount);
//		}
//		EXTI->PR |= BUTTON2;
//	} else if ((EXTI->PR & BUTTON3) != 0) {
//		if (currentTime - lastPressTime[2] >= DEBOUNCE_TIME) {
//			lastPressTime[2] = currentTime;
//			Light[2].carCount++;
//			printf("Light 3 car detected: %d\n\r", Light[2].carCount);
//		}
//		EXTI->PR |= BUTTON3;
//	} else if ((EXTI->PR & BUTTON4) != 0) {
//		if (currentTime - lastPressTime[3] >= DEBOUNCE_TIME) {
//			lastPressTime[3] = currentTime;
//			Light[3].carCount++;
//			printf("Light 4 car detected: %d\n\r", Light[3].carCount);
//		}
//		EXTI->PR |= BUTTON4;
//	}
//}


//void changeLightState(int lightNum) {
//    static uint32_t yellowStartTime[4];  // Store timers for each light
//
//    if (Light[lightNum].state == RED) {
//        // Transition directly from RED to GREEN
//        Light[lightNum].state = GREEN;
//        printf("Light %d turned GREEN\n\r", lightNum + 1);
//    } else if (Light[lightNum].state == GREEN) {
//        // Transition from GREEN to YELLOW
//        if (lightNum == 0 || lightNum == 1) {
//            turnYellow(lightNum, (lightNum == 0) ? 1 : 0);  // Light 0 with 1, or 1 with 0
//        } else if (lightNum == 2 || lightNum == 3) {
//            turnYellow(lightNum, (lightNum == 2) ? 3 : 2);  // Light 2 with 3, or 3 with 2
//        }
//        yellowStartTime[lightNum] = systickGetMillis();  // Store the yellow start time
//    } else if (Light[lightNum].state == YELLOW) {
//        // Check if 1 second has passed for YELLOW
//        if (systickGetMillis() - yellowStartTime[lightNum] >= 1000) {
//            Light[lightNum].state = RED;  // After 1 second, transition to RED
//            printf("Light %d turned RED\n\r", lightNum + 1);
//            updateLight(lightNum);
//        }
//    }
//}

//void changeLightState(int lightNum) {
//    static uint32_t yellowStartTime[4];  // Store timers for each light
//
//    if (Light[lightNum].state == RED) {
//        // Transition directly from RED to GREEN
//        Light[lightNum].state = GREEN;
//        printf("Light %d turned GREEN\n\r", lightNum + 1);
//    } else if (Light[lightNum].state == GREEN) {
//        // Transition from GREEN to YELLOW
//        if (lightNum == 0 || lightNum == 1) {
//            turnYellow(lightNum, (lightNum == 0) ? 1 : 0);  // Light 0 with 1, or 1 with 0
//        } else if (lightNum == 2 || lightNum == 3) {
//            turnYellow(lightNum, (lightNum == 2) ? 3 : 2);  // Light 2 with 3, or 3 with 2
//        }
//        yellowStartTime[lightNum] = systickGetMillis();  // Store the yellow start time
//    } else if (Light[lightNum].state == YELLOW) {
//        // Check if 1 second has passed for YELLOW
//        if (systickGetMillis() - yellowStartTime[lightNum] >= 1000) {
//            Light[lightNum].state = RED;  // After 1 second, transition to RED
//            printf("Light %d turned RED\n\r", lightNum + 1);
//            updateLight(lightNum);
//        }
//    }
//}

//void changeLightState(int lightNum) {
//
//    if (Light[lightNum].state == RED) {
//        // Transition directly from RED to GREEN
//        Light[lightNum].state = GREEN;
//        printf("Light %d turned GREEN\n\r", lightNum + 1);
//    } else if (Light[lightNum].state == GREEN) {
//    	if (lightNum == 0 || lightNum == 1) {
//			turnYellow(lightNum, (lightNum == 0) ? 1 : 0);  // Light 0 with 1, or 1 with 0
//		} else if (lightNum == 2 || lightNum == 3) {
//			turnYellow(lightNum, (lightNum == 2) ? 3 : 2);  // Light 2 with 3, or 3 with 2
//		}
//    	uint32_t yellowStartTime = systickGetMillis();
//    	if (systickGetMillis() - yellowStartTime >= 1000) {
//    		Light[lightNum].state = RED;  // After 1 second, transition to RED
//    		printf("Light %d turned RED\n\r", lightNum + 1);
//    	}
//    }
//}

//void changeLightState(int lightNum) {
//    static uint32_t yellowStartTime[4];  // Store separate timers for each light
//
//    if (Light[lightNum].state == RED) {
//        Light[lightNum].state = GREEN;
//        printf("Light %d turned GREEN\n\r", lightNum + 1);
//    } else if (Light[lightNum].state == GREEN) {
//        Light[lightNum].state = YELLOW;
//        printf("Light %d turned YELLOW\n\r", lightNum + 1);
//        yellowStartTime[lightNum] = systickGetMillis();  // Store yellow start time for this light
//    } else if (Light[lightNum].state == YELLOW) {
//        if (systickGetMillis() - yellowStartTime[lightNum] >= 1000) {
//            Light[lightNum].state = RED;
//            printf("Light %d turned RED\n\r", lightNum + 1);
//        }
//    }
//}

//void changeLightState(int lightNum) {
//    if (Light[lightNum].state == RED) {
//        Light[lightNum].state = GREEN;
//        printf("Light %d turned GREEN\n\r", lightNum + 1);
//    } else if (Light[lightNum].state == GREEN) {
//    	// Turn YELLOW ON for 1sec
//        Light[lightNum].state = YELLOW;
//        systickDelayMs(1000);
//        printf("Light %d turned YELLOW\n\r", lightNum + 1);
//        Light[lightNum].state = RED;
//        printf("Light %d turned RED\n\r", lightNum + 1);
//    }
//}

//void syncAndChangeLights(int lightA, int lightB, int lightC, int lightD) {
//    // Lights to be serviced
//    changeLightState(lightA);
//    changeLightState(lightB);
//    // Lights being serviced
//    changeLightState(lightC);
//    changeLightState(lightD);
//}

