HajjSalad/STM32-Traffic-Control/Src/main.c
//		if (!(GPIOB->IDR & (1U << 7))) {
//		    GPIOA->BSRR = (1U << 29);
//		    systickDelayMs(1000);
//		    GPIOA->BSRR = (1U << 30);
//		    systickDelayMs(1000);
//		} else {
//		    GPIOA->BSRR = ((1U << 13) | (1U << 14));
//		}

		// Check BUTTON2 (PA6) -> Control Light 2 (PA12 - Red)
//		if (!(GPIOA->IDR & (1U << 6))) {
//		    GPIOA->BSRR = (1U << 28);  // Turn Light 2 RED (PA12)
//		} else {
//		    GPIOA->BSRR = ((1U << 12) | (1U << 11));  // Turn Light 2 OFF
//		    GPIOB->BSRR = (1U << 7);  // Ensure PA7 (Blue) is off
//		}
//
//		// Check BUTTON3 (PC2) -> Control Light 3 (PC13 - Red)
//		if (!(GPIOC->IDR & (1U << 2))) {
//		    GPIOC->BSRR = (1U << 29);  // Turn Light 3 RED (PC13)
//		} else {
//		    GPIOC->BSRR = ((1U << 13) | (1U << 14) | (1U << 15));  // Turn Light 3 OFF
//		}
//
//		// Check BUTTON4 (PB7) -> Control Light 4 (PA13 - Red)
//		if (!(GPIOB->IDR & (1U << 7))) {
//		    GPIOA->BSRR = (1U << 29);  // Turn Light 4 RED (PA13)
//		} else {
//		    GPIOA->BSRR = ((1U << 13) | (1U << 14) | (1U << 15));  // Turn Light 4 OFF
//		}


		// If Button1 or Button3 pressed
//		if ((GPIOB->IDR & BUTTON1) | (GPIOB->IDR & BUTTON10)) {
//			GPIOC->BSRR = ((1U<<24) | (1U<<6) | (1U<<21));	// Light 1 GREEN
//			GPIOB->BSRR = ((1U<<18) | (1U<<0) | (1U<<31));	// Light 3 GREEN
//		} else if ((GPIOA->IDR & BUTTON2) | (GPIOB->IDR & BUTTON4)) {
//			GPIOA->BSRR = ((1U<<28) | (1U<<11) | (1U<<23));	// Light 2 GREEN
//			GPIOB->BSRR = ((1U<<30) | (1U<<13) | (1U<<21));	// Light 4 GREEN
//		}
